GreatCowBASIC/DATFileGenerator/incfiles/p18F16Q20.inc
        LIST
;==========================================================================
;
;  Built by GCBASIC convertor : 18F_PIC_to_INCv6_20
;  MPASM processor include for the chip shown below
;
; C:\Program Files\Microchip\MPLABX\v6.20\packs\index.idx
; C:\Program Files\Microchip\MPLABX\v6.20\packs\Microchip\PIC18F-Q_DFP\1.24.430\xc8\pic\dat\ini\18F16Q20.ini
; C:\Program Files\Microchip\MPLABX\v6.20\packs\Microchip\PIC18F-Q_DFP\1.24.430\edc\18F16Q20.PIC
; C:\Program Files\Microchip\MPLABX\v6.20\packs\Microchip\PIC18F-Q_DFP\1.24.430\xc8\pic\dat\cfgdata\18F16Q20.cfgdata
;
;==========================================================================
        NOLIST
        IFNDEF __PIC18F16Q20
           MESSG "Processor-header file mismatch.  Verify selected processor."
        ENDIF
;==========================================================================
;       18xxxx Family        EQUates
;==========================================================================
FSR0             EQU  0
FSR1             EQU  1
FSR2             EQU  2
FAST             EQU  1
W                EQU  0
A                EQU  0
ACCESS           EQU  0
BANKED           EQU  1
;==========================================================================
;
;       Register Definitions
;
;==========================================================================

;----- Register Files -----------------------------------------------------
PRLOCK           EQU  H'0038'
MAINPR           EQU  H'0039'
ISRPR            EQU  H'003A'
DMA1PR           EQU  H'003B'
DMA2PR           EQU  H'003C'
DMA3PR           EQU  H'003D'
DMA4PR           EQU  H'003E'
SCANPR           EQU  H'003F'
DMASELECT        EQU  H'0040'
DMANBUF          EQU  H'0041'
DMANDCNT         EQU  H'0042'
DMANDCNTL        EQU  H'0042'
DMANDCNTH        EQU  H'0043'
DMANDPTR         EQU  H'0044'
DMANDPTRL        EQU  H'0044'
DMANDPTRH        EQU  H'0045'
DMANDSZ          EQU  H'0046'
DMANDSZL         EQU  H'0046'
DMANDSZH         EQU  H'0047'
DMANDSA          EQU  H'0048'
DMANDSAL         EQU  H'0048'
DMANDSAH         EQU  H'0049'
DMANSCNT         EQU  H'004A'
DMANSCNTL        EQU  H'004A'
DMANSCNTH        EQU  H'004B'
DMANSPTR         EQU  H'004C'
DMANSPTRL        EQU  H'004C'
DMANSPTRH        EQU  H'004D'
DMANSPTRU        EQU  H'004E'
DMANSSZ          EQU  H'004F'
DMANSSZL         EQU  H'004F'
DMANSSZH         EQU  H'0050'
DMANSSA          EQU  H'0051'
DMANSSAL         EQU  H'0051'
DMANSSAH         EQU  H'0052'
DMANSSAU         EQU  H'0053'
DMANCON0         EQU  H'0054'
DMANCON1         EQU  H'0055'
DMANAIRQ         EQU  H'0056'
DMANSIRQ         EQU  H'0057'
NVMCON0          EQU  H'0058'
NVMCON1          EQU  H'0059'
NVMLOCK          EQU  H'005A'
NVMADR           EQU  H'005B'
NVMADRL          EQU  H'005B'
NVMADRH          EQU  H'005C'
NVMADRU          EQU  H'005D'
NVMDAT           EQU  H'005E'
NVMDATL          EQU  H'005E'
NVMDATH          EQU  H'005F'
CRCDATA          EQU  H'0060'
CRCDATAL         EQU  H'0060'
CRCDATAH         EQU  H'0061'
CRCDATAU         EQU  H'0062'
CRCDATAT         EQU  H'0063'
CRCOUT           EQU  H'0064'
CRCSHFT          EQU  H'0064'
CRCXOR           EQU  H'0064'
CRCOUTL          EQU  H'0064'
CRCSHFTL         EQU  H'0064'
CRCSHIFTL        EQU  H'0064'
CRCXORL          EQU  H'0064'
CRCOUTH          EQU  H'0065'
CRCSHFTH         EQU  H'0065'
CRCSHIFTH        EQU  H'0065'
CRCXORH          EQU  H'0065'
CRCOUTU          EQU  H'0066'
CRCSHFTU         EQU  H'0066'
CRCSHIFTU        EQU  H'0066'
CRCXORU          EQU  H'0066'
CRCOUTT          EQU  H'0067'
CRCSHFTT         EQU  H'0067'
CRCSHIFTT        EQU  H'0067'
CRCXORT          EQU  H'0067'
CRCCON0          EQU  H'0068'
CRCCON1          EQU  H'0069'
CRCCON2          EQU  H'006A'
SCANLADR         EQU  H'006B'
SCANLADRL        EQU  H'006B'
SCANLADRH        EQU  H'006C'
SCANLADRU        EQU  H'006D'
SCANHADR         EQU  H'006E'
SCANHADRL        EQU  H'006E'
SCANHADRH        EQU  H'006F'
SCANHADRU        EQU  H'0070'
SCANCON0         EQU  H'0071'
SCANTRIG         EQU  H'0072'
BORCON           EQU  H'0073'
WDTCON0          EQU  H'0074'
WDTCON1          EQU  H'0075'
WDTPS            EQU  H'0076'
WDTPSL           EQU  H'0076'
WDTPSH           EQU  H'0077'
WDTTMR           EQU  H'0078'
VREGCON          EQU  H'0079'
OSCCON1          EQU  H'007A'
OSCCON2          EQU  H'007B'
OSCCON3          EQU  H'007C'
OSCSTAT          EQU  H'007D'
OSCSTAT1         EQU  H'007D'
OSCEN            EQU  H'007E'
OSCTUNE          EQU  H'007F'
OSCFRQ           EQU  H'0080'
OSCFREQ          EQU  H'0080'
ACTCON           EQU  H'0081'
FSCMCON          EQU  H'0082'
I3C1CON0         EQU  H'0083'
I3C1CON1         EQU  H'0084'
I3C1RXB          EQU  H'0085'
I3C1TXB          EQU  H'0086'
I3C1STAT0        EQU  H'0087'
I3C1STAT1        EQU  H'0088'
I3C1BSTAT        EQU  H'0089'
I3C1PIR0         EQU  H'008A'
I3C1PIR1         EQU  H'008B'
I3C1ERRIR0       EQU  H'008C'
I3C1ERRIR1       EQU  H'008D'
I3C1PIE0         EQU  H'008E'
I3C1PIE1         EQU  H'008F'
I3C1ERRIE0       EQU  H'0090'
I3C1ERRIE1       EQU  H'0091'
I3C1BIDL         EQU  H'0092'
I3C1BIDLL        EQU  H'0092'
I3C1BIDLH        EQU  H'0093'
I3C1BAVL         EQU  H'0094'
I3C1BTO          EQU  H'0095'
I3C1BTOL         EQU  H'0095'
I3C1BTOH         EQU  H'0096'
I3C1IBIMDB       EQU  H'0097'
I3C1RETRY        EQU  H'0098'
I3C1FEAT         EQU  H'0099'
I3C1SADR         EQU  H'009A'
I3C1DADR         EQU  H'009B'
I3C1EC           EQU  H'009C'
I3C1MWL          EQU  H'009D'
I3C1MWLL         EQU  H'009D'
I3C1MWLH         EQU  H'009E'
I3C1MRL          EQU  H'009F'
I3C1MRLL         EQU  H'009F'
I3C1MRLH         EQU  H'00A0'
I3C1IBIPSZ       EQU  H'00A1'
I3C1PID0         EQU  H'00A2'
I3C1PID1         EQU  H'00A3'
I3C1PID2         EQU  H'00A4'
I3C1PID3         EQU  H'00A5'
I3C1PID4         EQU  H'00A6'
I3C1PID5         EQU  H'00A7'
I3C1BCR          EQU  H'00A8'
I3C1DCR          EQU  H'00A9'
I3C1DSTAT0       EQU  H'00AA'
I3C1DSTAT1       EQU  H'00AB'
I3C1MWS          EQU  H'00AC'
I3C1MRS          EQU  H'00AD'
I3C1MRT          EQU  H'00AE'
I3C1MRTL         EQU  H'00AE'
I3C1MRTH         EQU  H'00AF'
I3C1MRTU         EQU  H'00B0'
I3C1RSTACT       EQU  H'00B1'
I3C1BUSCXT       EQU  H'00B2'
I3C1CCC          EQU  H'00B3'
I3C1I2CCON       EQU  H'00B4'
I3C1CLK          EQU  H'00B5'
I3C2CON0         EQU  H'00B6'
I3C2CON1         EQU  H'00B7'
I3C2RXB          EQU  H'00B8'
I3C2TXB          EQU  H'00B9'
I3C2STAT0        EQU  H'00BA'
I3C2STAT1        EQU  H'00BB'
I3C2BSTAT        EQU  H'00BC'
I3C2PIR0         EQU  H'00BD'
I3C2PIR1         EQU  H'00BE'
I3C2ERRIR0       EQU  H'00BF'
I3C2ERRIR1       EQU  H'00C0'
I3C2PIE0         EQU  H'00C1'
I3C2PIE1         EQU  H'00C2'
I3C2ERRIE0       EQU  H'00C3'
I3C2ERRIE1       EQU  H'00C4'
I3C2BIDL         EQU  H'00C5'
I3C2BIDLL        EQU  H'00C5'
I3C2BIDLH        EQU  H'00C6'
I3C2BAVL         EQU  H'00C7'
I3C2BTO          EQU  H'00C8'
I3C2BTOL         EQU  H'00C8'
I3C2BTOH         EQU  H'00C9'
I3C2IBIMDB       EQU  H'00CA'
I3C2RETRY        EQU  H'00CB'
I3C2FEAT         EQU  H'00CC'
I3C2SADR         EQU  H'00CD'
I3C2DADR         EQU  H'00CE'
I3C2EC           EQU  H'00CF'
I3C2MWL          EQU  H'00D0'
I3C2MWLL         EQU  H'00D0'
I3C2MWLH         EQU  H'00D1'
I3C2MRL          EQU  H'00D2'
I3C2MRLL         EQU  H'00D2'
I3C2MRLH         EQU  H'00D3'
I3C2IBIPSZ       EQU  H'00D4'
I3C2PID0         EQU  H'00D5'
I3C2PID1         EQU  H'00D6'
I3C2PID2         EQU  H'00D7'
I3C2PID3         EQU  H'00D8'
I3C2PID4         EQU  H'00D9'
I3C2PID5         EQU  H'00DA'
I3C2BCR          EQU  H'00DB'
I3C2DCR          EQU  H'00DC'
I3C2DSTAT0       EQU  H'00DD'
I3C2DSTAT1       EQU  H'00DE'
I3C2MWS          EQU  H'00DF'
I3C2MRS          EQU  H'00E0'
I3C2MRT          EQU  H'00E1'
I3C2MRTL         EQU  H'00E1'
I3C2MRTH         EQU  H'00E2'
I3C2MRTU         EQU  H'00E3'
I3C2RSTACT       EQU  H'00E4'
I3C2BUSCXT       EQU  H'00E5'
I3C2CCC          EQU  H'00E6'
I3C2I2CCON       EQU  H'00E7'
I3C2CLK          EQU  H'00E8'
CLKRCON          EQU  H'0100'
CLKRCLK          EQU  H'0101'
TMR0L            EQU  H'0103'
TMR0             EQU  H'0103'
TMR0H            EQU  H'0104'
PR0              EQU  H'0104'
T0CON0           EQU  H'0105'
T0CON1           EQU  H'0106'
TMR1             EQU  H'0107'
TMR1L            EQU  H'0107'
TMR1H            EQU  H'0108'
T1CON            EQU  H'0109'
TMR1CON          EQU  H'0109'
T1GCON           EQU  H'010A'
TMR1GCON         EQU  H'010A'
T1GATE           EQU  H'010B'
TMR1GATE         EQU  H'010B'
T1CLK            EQU  H'010C'
TMR1CLK          EQU  H'010C'
PR1              EQU  H'010C'
T2TMR            EQU  H'0119'
TMR2             EQU  H'0119'
T2PR             EQU  H'011A'
PR2              EQU  H'011A'
T2CON            EQU  H'011B'
T2HLT            EQU  H'011C'
T2CLKCON         EQU  H'011D'
T2CLK            EQU  H'011D'
T2RST            EQU  H'011E'
T4TMR            EQU  H'011F'
TMR4             EQU  H'011F'
T4PR             EQU  H'0120'
PR4              EQU  H'0120'
T4CON            EQU  H'0121'
T4HLT            EQU  H'0122'
T4CLKCON         EQU  H'0123'
T4CLK            EQU  H'0123'
T4RST            EQU  H'0124'
TUCHAIN          EQU  H'012B'
TU16ACON0        EQU  H'012C'
TU16ACON1        EQU  H'012D'
TU16AHLT         EQU  H'012E'
TU16APS          EQU  H'012F'
TU16ATMR         EQU  H'0130'
TU16ACR          EQU  H'0130'
TU16ATMRL        EQU  H'0130'
TU16ACRL         EQU  H'0130'
TU16ATMRH        EQU  H'0131'
TU16ACRH         EQU  H'0131'
TU16ATMRT        EQU  H'0133'
TU16ACRT         EQU  H'0133'
TU16APR          EQU  H'0134'
TU16APRL         EQU  H'0134'
TU16APRH         EQU  H'0135'
TU16APRT         EQU  H'0137'
TU16ACLK         EQU  H'0138'
TU16AERS         EQU  H'0139'
TU16BCON0        EQU  H'013A'
TU16BCON1        EQU  H'013B'
TU16BHLT         EQU  H'013C'
TU16BPS          EQU  H'013D'
TU16BTMR         EQU  H'013E'
TU16BCR          EQU  H'013E'
TU16BTMRL        EQU  H'013E'
TU16BCRL         EQU  H'013E'
TU16BTMRH        EQU  H'013F'
TU16BCRH         EQU  H'013F'
TU16BTMRT        EQU  H'0141'
TU16BCRT         EQU  H'0141'
TU16BPR          EQU  H'0142'
TU16BPRL         EQU  H'0142'
TU16BPRH         EQU  H'0143'
TU16BPRT         EQU  H'0145'
TU16BCLK         EQU  H'0146'
TU16BERS         EQU  H'0147'
CCPTMRS0         EQU  H'0148'
CCPR1            EQU  H'0149'
CCPR1L           EQU  H'0149'
CCPR1H           EQU  H'014A'
CCP1CON          EQU  H'014B'
CCP1CAP          EQU  H'014C'
CCPR2            EQU  H'014D'
CCPR2L           EQU  H'014D'
CCPR2H           EQU  H'014E'
CCP2CON          EQU  H'014F'
CCP2CAP          EQU  H'0150'
PWMLOAD          EQU  H'0151'
PWMEN            EQU  H'0152'
PWM1ERS          EQU  H'0153'
PWM1CLK          EQU  H'0154'
PWM1LDS          EQU  H'0155'
PWM1PR           EQU  H'0156'
PWM1PRL          EQU  H'0156'
PWM1PRH          EQU  H'0157'
PWM1CPRE         EQU  H'0158'
PWM1PIPOS        EQU  H'0159'
PWM1GIR          EQU  H'015A'
PWM1GIE          EQU  H'015B'
PWM1CON          EQU  H'015C'
PWM1S1CFG        EQU  H'015D'
PWM1S1P1         EQU  H'015E'
PWM1S1P1L        EQU  H'015E'
PWM1S1P1H        EQU  H'015F'
PWM1S1P2         EQU  H'0160'
PWM1S1P2L        EQU  H'0160'
PWM1S1P2H        EQU  H'0161'
PWM2ERS          EQU  H'0162'
PWM2CLK          EQU  H'0163'
PWM2LDS          EQU  H'0164'
PWM2PR           EQU  H'0165'
PWM2PRL          EQU  H'0165'
PWM2PRH          EQU  H'0166'
PWM2CPRE         EQU  H'0167'
PWM2PIPOS        EQU  H'0168'
PWM2GIR          EQU  H'0169'
PWM2GIE          EQU  H'016A'
PWM2CON          EQU  H'016B'
PWM2S1CFG        EQU  H'016C'
PWM2S1P1         EQU  H'016D'
PWM2S1P1L        EQU  H'016D'
PWM2S1P1H        EQU  H'016E'
PWM2S1P2         EQU  H'016F'
PWM2S1P2L        EQU  H'016F'
PWM2S1P2H        EQU  H'0170'
CWG1CLK          EQU  H'0199'
CWG1CLKCON       EQU  H'0199'
CWG1ISM          EQU  H'019A'
CWG1DAT          EQU  H'019A'
CWG1DBR          EQU  H'019B'
CWG1DBF          EQU  H'019C'
CWG1CON0         EQU  H'019D'
CWG1CON1         EQU  H'019E'
CWG1AS0          EQU  H'019F'
CWG1AS1          EQU  H'01A0'
CWG1STR          EQU  H'01A1'
CLCDATA          EQU  H'01A3'
CLCSELECT        EQU  H'01A4'
CLCNCON          EQU  H'01A5'
CLCNPOL          EQU  H'01A6'
CLCNSEL0         EQU  H'01A7'
CLCNSEL1         EQU  H'01A8'
CLCNSEL2         EQU  H'01A9'
CLCNSEL3         EQU  H'01AA'
CLCNGLS0         EQU  H'01AB'
CLCNGLS1         EQU  H'01AC'
CLCNGLS2         EQU  H'01AD'
CLCNGLS3         EQU  H'01AE'
U1RXB            EQU  H'01AF'
U1RXBL           EQU  H'01AF'
U1RXCHK          EQU  H'01B0'
U1TXB            EQU  H'01B1'
U1TXBL           EQU  H'01B1'
U1TXCHK          EQU  H'01B2'
U1P1             EQU  H'01B3'
U1P1L            EQU  H'01B3'
U1P1H            EQU  H'01B4'
U1P2             EQU  H'01B5'
U1P2L            EQU  H'01B5'
U1P2H            EQU  H'01B6'
U1P3             EQU  H'01B7'
U1P3L            EQU  H'01B7'
U1P3H            EQU  H'01B8'
U1CON0           EQU  H'01B9'
U1CON1           EQU  H'01BA'
U1CON2           EQU  H'01BB'
U1BRG            EQU  H'01BC'
U1BRGL           EQU  H'01BC'
U1BRGH           EQU  H'01BD'
U1FIFO           EQU  H'01BE'
U1UIR            EQU  H'01C0'
U1ERRIR          EQU  H'01C1'
U1ERRIE          EQU  H'01C2'
U2RXB            EQU  H'01C3'
U2RXBL           EQU  H'01C3'
U2TXB            EQU  H'01C5'
U2TXBL           EQU  H'01C5'
U2P1             EQU  H'01C7'
U2P1L            EQU  H'01C7'
U2P2             EQU  H'01C9'
U2P2L            EQU  H'01C9'
U2P3             EQU  H'01CB'
U2P3L            EQU  H'01CB'
U2CON0           EQU  H'01CD'
U2CON1           EQU  H'01CE'
U2CON2           EQU  H'01CF'
U2BRG            EQU  H'01D0'
U2BRGL           EQU  H'01D0'
U2BRGH           EQU  H'01D1'
U2FIFO           EQU  H'01D2'
U2UIR            EQU  H'01D4'
U2ERRIR          EQU  H'01D5'
U2ERRIE          EQU  H'01D6'
SPI1RXB          EQU  H'01D7'
SPI1TXB          EQU  H'01D8'
SPI1TCNT         EQU  H'01D9'
SPI1TCNTL        EQU  H'01D9'
SPI1TCNTH        EQU  H'01DA'
SPI1CON0         EQU  H'01DB'
SPI1CON1         EQU  H'01DC'
SPI1CON2         EQU  H'01DD'
SPI1STATUS       EQU  H'01DE'
SPI1TWIDTH       EQU  H'01DF'
SPI1BAUD         EQU  H'01E0'
SPI1INTF         EQU  H'01E1'
SPI1INTE         EQU  H'01E2'
SPI1CLK          EQU  H'01E3'
I2C1STAT0        EQU  H'01E4'
I2C1STAT1        EQU  H'01E5'
I2C1CON0         EQU  H'01E6'
I2C1CON1         EQU  H'01E7'
I2C1CON2         EQU  H'01E8'
I2C1CON3         EQU  H'01E9'
I2C1PIR          EQU  H'01EA'
I2C1PIE          EQU  H'01EB'
I2C1ERR          EQU  H'01EC'
I2C1CNT          EQU  H'01ED'
I2C1CNTL         EQU  H'01ED'
I2C1CNTH         EQU  H'01EE'
I2C1RXB          EQU  H'01EF'
I2C1TXB          EQU  H'01F0'
I2C1ADB0         EQU  H'01F1'
I2C1ADB1         EQU  H'01F2'
I2C1ADR0         EQU  H'01F3'
I2C1ADR1         EQU  H'01F4'
I2C1ADR2         EQU  H'01F5'
I2C1ADR3         EQU  H'01F6'
I2C1BTO          EQU  H'01F7'
I2C1BAUD         EQU  H'01F8'
I2C1CLK          EQU  H'01F9'
I2C1BTOC         EQU  H'01FA'
FVRCON           EQU  H'0201'
HLVDCON0         EQU  H'0202'
HLVDCON1         EQU  H'0203'
ADLTH            EQU  H'0215'
ADLTHL           EQU  H'0215'
ADLTHH           EQU  H'0216'
ADUTH            EQU  H'0217'
ADUTHL           EQU  H'0217'
ADUTHH           EQU  H'0218'
ADERR            EQU  H'0219'
ADERRL           EQU  H'0219'
ADERRH           EQU  H'021A'
ADSTPT           EQU  H'021B'
ADSTPTL          EQU  H'021B'
ADSTPTH          EQU  H'021C'
ADFLTR           EQU  H'021D'
ADFLTRL          EQU  H'021D'
ADFLTRH          EQU  H'021E'
ADACC            EQU  H'021F'
ADACCL           EQU  H'021F'
ADACCH           EQU  H'0220'
ADCNT            EQU  H'0222'
ADRPT            EQU  H'0223'
ADPREV           EQU  H'0224'
ADPREVL          EQU  H'0224'
ADPREVH          EQU  H'0225'
ADRES            EQU  H'0226'
ADRESL           EQU  H'0226'
ADRESH           EQU  H'0227'
ADPCH            EQU  H'0228'
ADNCH            EQU  H'0229'
ADACQ            EQU  H'022A'
ADACQL           EQU  H'022A'
ADACQH           EQU  H'022B'
ADCAP            EQU  H'022C'
ADPRE            EQU  H'022D'
ADPREL           EQU  H'022D'
ADPREH           EQU  H'022E'
ADCON0           EQU  H'022F'
ADCON1           EQU  H'0230'
ADCON2           EQU  H'0231'
ADCON3           EQU  H'0232'
ADSTAT           EQU  H'0233'
ADREF            EQU  H'0234'
ADACT            EQU  H'0235'
ADCLK            EQU  H'0236'
ADCG1A           EQU  H'0237'
ADCG1B           EQU  H'0238'
ADCG1C           EQU  H'0239'
PMD0             EQU  H'0300'
PMD1             EQU  H'0301'
PMD2             EQU  H'0302'
PMD3             EQU  H'0303'
PMD4             EQU  H'0304'
RB5FEAT          EQU  H'030F'
RB6FEAT          EQU  H'0310'
RC0FEAT          EQU  H'0312'
RC1FEAT          EQU  H'0313'
RC4FEAT          EQU  H'0315'
RC5FEAT          EQU  H'0316'
RA0PPS           EQU  H'0319'
RA1PPS           EQU  H'031A'
RA2PPS           EQU  H'031B'
RA4PPS           EQU  H'031D'
RA5PPS           EQU  H'031E'
RB5PPS           EQU  H'0326'
RB6PPS           EQU  H'0327'
RB7PPS           EQU  H'0328'
RC0PPS           EQU  H'0329'
RC1PPS           EQU  H'032A'
RC3PPS           EQU  H'032C'
RC4PPS           EQU  H'032D'
RC5PPS           EQU  H'032E'
RC6PPS           EQU  H'032F'
RC7PPS           EQU  H'0330'
PPSLOCK          EQU  H'0351'
INT0PPS          EQU  H'0352'
INT1PPS          EQU  H'0353'
INT2PPS          EQU  H'0354'
T0CKIPPS         EQU  H'0355'
T1CKIPPS         EQU  H'0356'
T1GPPS           EQU  H'0357'
T2INPPS          EQU  H'0360'
T4INPPS          EQU  H'0361'
TUIN0PPS         EQU  H'0365'
TUIN1PPS         EQU  H'0366'
CCP1PPS          EQU  H'0369'
CCP2PPS          EQU  H'036A'
STATUS_CSHAD     EQU  H'0373'
WREG_CSHAD       EQU  H'0374'
BSR_CSHAD        EQU  H'0375'
SHADCON          EQU  H'0376'
STATUS_SHAD      EQU  H'0377'
WREG_SHAD        EQU  H'0378'
BSR_SHAD         EQU  H'0379'
PCLAT_SHAD       EQU  H'037A'
PCLATH_SHAD      EQU  H'037A'
PCLATU_SHAD      EQU  H'037B'
FSR0_SHAD        EQU  H'037C'
FSR0L_SHAD       EQU  H'037C'
FSR0H_SHAD       EQU  H'037D'
FSR1_SHAD        EQU  H'037E'
FSR1L_SHAD       EQU  H'037E'
FSR1H_SHAD       EQU  H'037F'
FSR2_SHAD        EQU  H'0380'
FSR2L_SHAD       EQU  H'0380'
FSR2H_SHAD       EQU  H'0381'
PROD_SHAD        EQU  H'0382'
PRODL_SHAD       EQU  H'0382'
PRODH_SHAD       EQU  H'0383'
PWMIN0PPS        EQU  H'0384'
PWMIN1PPS        EQU  H'0385'
PWM1ERSPPS       EQU  H'0386'
PWM2ERSPPS       EQU  H'0387'
CWG1PPS          EQU  H'0399'
CWG1INPPS        EQU  H'0399'
CLCIN0PPS        EQU  H'039D'
CLCIN1PPS        EQU  H'039E'
CLCIN2PPS        EQU  H'039F'
CLCIN3PPS        EQU  H'03A0'
U1CTSPPS         EQU  H'03A1'
U1RXPPS          EQU  H'03A2'
U2CTSPPS         EQU  H'03A3'
U2RXPPS          EQU  H'03A4'
SPI1SCKPPS       EQU  H'03A7'
SPI1SDIPPS       EQU  H'03A8'
SPI1SSPPS        EQU  H'03A9'
I2C1SCLPPS       EQU  H'03AD'
I2C1SDAPPS       EQU  H'03AE'
ADACTPPS         EQU  H'03B1'
ANSELA           EQU  H'0416'
WPUA             EQU  H'0417'
ODCONA           EQU  H'0418'
SLRCONA          EQU  H'0419'
INLVLA           EQU  H'041A'
IOCAP            EQU  H'041B'
IOCAN            EQU  H'041C'
IOCAF            EQU  H'041D'
ANSELB           EQU  H'0420'
WPUB             EQU  H'0421'
ODCONB           EQU  H'0422'
SLRCONB          EQU  H'0423'
INLVLB           EQU  H'0424'
IOCBP            EQU  H'0425'
IOCBN            EQU  H'0426'
IOCBF            EQU  H'0427'
ANSELC           EQU  H'042A'
WPUC             EQU  H'042B'
ODCONC           EQU  H'042C'
SLRCONC          EQU  H'042D'
INLVLC           EQU  H'042E'
IOCCP            EQU  H'042F'
IOCCN            EQU  H'0430'
IOCCF            EQU  H'0431'
IOCWP            EQU  H'0457'
IOCWN            EQU  H'0458'
IOCWF            EQU  H'0459'
IVTLOCK          EQU  H'0460'
INTCON0          EQU  H'0461'
INTCON1          EQU  H'0462'
IVTAD            EQU  H'0463'
IVTADL           EQU  H'0463'
IVTADH           EQU  H'0464'
IVTADU           EQU  H'0465'
IVTBASE          EQU  H'0466'
IVTBASEL         EQU  H'0466'
IVTBASEH         EQU  H'0467'
IVTBASEU         EQU  H'0468'
PIR0             EQU  H'0469'
PIR1             EQU  H'046A'
PIR2             EQU  H'046B'
PIR3             EQU  H'046C'
PIR4             EQU  H'046D'
PIR5             EQU  H'046E'
PIR6             EQU  H'046F'
PIR7             EQU  H'0470'
PIR8             EQU  H'0471'
PIR9             EQU  H'0472'
PIE0             EQU  H'0473'
PIE1             EQU  H'0474'
PIE2             EQU  H'0475'
PIE3             EQU  H'0476'
PIE4             EQU  H'0477'
PIE5             EQU  H'0478'
PIE6             EQU  H'0479'
PIE7             EQU  H'047A'
PIE8             EQU  H'047B'
PIE9             EQU  H'047C'
IPR0             EQU  H'047D'
IPR1             EQU  H'047E'
IPR2             EQU  H'047F'
IPR3             EQU  H'0480'
IPR4             EQU  H'0481'
IPR5             EQU  H'0482'
IPR6             EQU  H'0483'
IPR7             EQU  H'0484'
IPR8             EQU  H'0485'
IPR9             EQU  H'0486'
PORTA            EQU  H'0487'
PORTB            EQU  H'0488'
PORTC            EQU  H'0489'
TRISA            EQU  H'048D'
TRISB            EQU  H'048E'
TRISC            EQU  H'048F'
LATA             EQU  H'0493'
LATB             EQU  H'0494'
LATC             EQU  H'0495'
PORTW            EQU  H'0499'
LATW             EQU  H'049A'
PORTWIN0         EQU  H'049B'
PORTWIN1         EQU  H'049C'
PORTWIN2         EQU  H'049D'
PORTWIN3         EQU  H'049E'
PORTWIN4         EQU  H'049F'
PORTWIN5         EQU  H'04A0'
PORTWIN6         EQU  H'04A1'
PORTWIN7         EQU  H'04A2'
PORTWCLK         EQU  H'04A3'
PORTWDF          EQU  H'04A4'
PORTWCON         EQU  H'04A5'
MVIOSTAT         EQU  H'04A6'
STATUS           EQU  H'04D8'
; SFR=FSR2,4D9,16 is a reserved word
FSR2L            EQU  H'04D9'
FSR2H            EQU  H'04DA'
PLUSW2           EQU  H'04DB'
PREINC2          EQU  H'04DC'
POSTDEC2         EQU  H'04DD'
POSTINC2         EQU  H'04DE'
INDF2            EQU  H'04DF'
BSR              EQU  H'04E0'
; SFR=FSR1,4E1,16 is a reserved word
FSR1L            EQU  H'04E1'
FSR1H            EQU  H'04E2'
PLUSW1           EQU  H'04E3'
PREINC1          EQU  H'04E4'
POSTDEC1         EQU  H'04E5'
POSTINC1         EQU  H'04E6'
INDF1            EQU  H'04E7'
WREG             EQU  H'04E8'
; SFR=W,4E8,8 is a reserved word
; SFR=FSR0,4E9,16 is a reserved word
FSR0L            EQU  H'04E9'
FSR0H            EQU  H'04EA'
PLUSW0           EQU  H'04EB'
PREINC0          EQU  H'04EC'
POSTDEC0         EQU  H'04ED'
POSTINC0         EQU  H'04EE'
INDF0            EQU  H'04EF'
PCON0            EQU  H'04F0'
PCON1            EQU  H'04F1'
CPUDOZE          EQU  H'04F2'
PROD             EQU  H'04F3'
PRODL            EQU  H'04F3'
PRODH            EQU  H'04F4'
TABLAT           EQU  H'04F5'
TBLPTR           EQU  H'04F6'
TBLPTRL          EQU  H'04F6'
TBLPTRH          EQU  H'04F7'
TBLPTRU          EQU  H'04F8'
PCLAT            EQU  H'04F9'
PCL              EQU  H'04F9'
PCLATH           EQU  H'04FA'
PCLATU           EQU  H'04FB'
STKPTR           EQU  H'04FC'
TOS              EQU  H'04FD'
TOSL             EQU  H'04FD'
TOSH             EQU  H'04FE'
TOSU             EQU  H'04FF'


