GreatCowBASIC/DATFileGenerator/incfiles/p18F16Q20.inc
;----- I3C1FEAT Bits -----------------------------------------------------
HJCAP            EQU  H'0000'
HDRCAP           EQU  H'0001'


;----- I3C1SADR Bits -----------------------------------------------------
SADR0            EQU  H'0000'
SADR1            EQU  H'0001'
SADR2            EQU  H'0002'
SADR3            EQU  H'0003'
SADR4            EQU  H'0004'
SADR5            EQU  H'0005'
SADR6            EQU  H'0006'


;----- I3C1DADR Bits -----------------------------------------------------
DADR0            EQU  H'0000'
DADR1            EQU  H'0001'
DADR2            EQU  H'0002'
DADR3            EQU  H'0003'
DADR4            EQU  H'0004'
DADR5            EQU  H'0005'
DADR6            EQU  H'0006'


;----- I3C1EC Bits -----------------------------------------------------
IBIEN            EQU  H'0000'
CREN             EQU  H'0001'
EC2              EQU  H'0002'
HJEN             EQU  H'0003'
EC_7_40          EQU  H'0004'
EC_7_41          EQU  H'0005'
EC_7_42          EQU  H'0006'
EC_7_43          EQU  H'0007'


;----- I3C1MWL Bits -----------------------------------------------------


;----- I3C1MWLH Bits -----------------------------------------------------


;----- I3C1MRL Bits -----------------------------------------------------


;----- I3C1MRLH Bits -----------------------------------------------------


;----- I3C1IBIPSZ Bits -----------------------------------------------------


;----- I3C1PID0 Bits -----------------------------------------------------
PID0             EQU  H'0000'
PID1             EQU  H'0001'
PID2             EQU  H'0002'
PID3             EQU  H'0003'
PID4             EQU  H'0004'
PID5             EQU  H'0005'
PID6             EQU  H'0006'
PID7             EQU  H'0007'


;----- I3C1PID2 Bits -----------------------------------------------------
PID16            EQU  H'0000'
PID17            EQU  H'0001'
PID18            EQU  H'0002'
PID19            EQU  H'0003'
PID20            EQU  H'0004'
PID21            EQU  H'0005'
PID22            EQU  H'0006'
PID23            EQU  H'0007'


;----- I3C1PID3 Bits -----------------------------------------------------
PID24            EQU  H'0000'
PID25            EQU  H'0001'
PID26            EQU  H'0002'
PID27            EQU  H'0003'
PID28            EQU  H'0004'
PID29            EQU  H'0005'
PID30            EQU  H'0006'
PID31            EQU  H'0007'


;----- I3C1PID4 Bits -----------------------------------------------------
PID32            EQU  H'0000'
PID33            EQU  H'0001'
PID34            EQU  H'0002'
PID35            EQU  H'0003'
PID36            EQU  H'0004'
PID37            EQU  H'0005'
PID38            EQU  H'0006'
PID39            EQU  H'0007'
PID_39_330       EQU  H'0001'
PID_39_331       EQU  H'0002'
PID_39_332       EQU  H'0003'
PID_39_333       EQU  H'0004'
PID_39_334       EQU  H'0005'
PID_39_335       EQU  H'0006'
PID_39_336       EQU  H'0007'


;----- I3C1PID5 Bits -----------------------------------------------------
PID40            EQU  H'0000'
PID41            EQU  H'0001'
PID42            EQU  H'0002'
PID43            EQU  H'0003'
PID44            EQU  H'0004'
PID45            EQU  H'0005'
PID46            EQU  H'0006'
PID47            EQU  H'0007'


;----- I3C1BCR Bits -----------------------------------------------------
BCR0             EQU  H'0000'
BCR1             EQU  H'0001'
BCR2             EQU  H'0002'
BCR3             EQU  H'0003'
BCR4             EQU  H'0004'
BCR5             EQU  H'0005'
BCR6             EQU  H'0006'
BCR7             EQU  H'0007'
BCR_7_60         EQU  H'0006'
BCR_7_61         EQU  H'0007'


;----- I3C1DCR Bits -----------------------------------------------------


;----- I3C1DSTAT0 Bits -----------------------------------------------------
INTPEND0         EQU  H'0000'
INTPEND1         EQU  H'0001'
INTPEND2         EQU  H'0002'
INTPEND3         EQU  H'0003'
PERR             EQU  H'0005'
ACTMODE0         EQU  H'0006'
ACTMODE1         EQU  H'0007'
INPEND0          EQU  H'0000'
INTPEND1         EQU  H'0001'
INTPEND2         EQU  H'0002'
INTPEND3         EQU  H'0003'
ACTMODE0         EQU  H'0006'
ACTMODE1         EQU  H'0007'


;----- I3C1DSTAT1 Bits -----------------------------------------------------
VRSV0            EQU  H'0000'
VRSV1            EQU  H'0001'
VRSV2            EQU  H'0002'
VRSV3            EQU  H'0003'
VRSV4            EQU  H'0004'
VRSV5            EQU  H'0005'
VRSV6            EQU  H'0006'
VRSV7            EQU  H'0007'


;----- I3C1MWS Bits -----------------------------------------------------
MWS0             EQU  H'0000'
MWS1             EQU  H'0001'
MWS2             EQU  H'0002'
MWS3             EQU  H'0003'
MWS4             EQU  H'0004'
MWS5             EQU  H'0005'
MWS6             EQU  H'0006'
MWS7             EQU  H'0007'
MWS_2_00         EQU  H'0000'
MWS_2_01         EQU  H'0001'
MWS_2_02         EQU  H'0002'
MWS_7_40         EQU  H'0004'
MWS_7_41         EQU  H'0005'
MWS_7_42         EQU  H'0006'
MWS_7_43         EQU  H'0007'


;----- I3C1MRS Bits -----------------------------------------------------
MRS0             EQU  H'0000'
MRS1             EQU  H'0001'
MRS2             EQU  H'0002'
MRS3             EQU  H'0003'
MRS4             EQU  H'0004'
MRS5             EQU  H'0005'
MRS6             EQU  H'0006'
MRS7             EQU  H'0007'
MRS_2_00         EQU  H'0000'
MRS_2_01         EQU  H'0001'
MRS_2_02         EQU  H'0002'
MRS_5_30         EQU  H'0003'
MRS_5_31         EQU  H'0004'
MRS_5_32         EQU  H'0005'


;----- I3C1MRT Bits -----------------------------------------------------


;----- I3C1MRTH Bits -----------------------------------------------------


;----- I3C1MRTU Bits -----------------------------------------------------


;----- I3C1RSTACT Bits -----------------------------------------------------


;----- I3C1BUSCXT Bits -----------------------------------------------------


;----- I3C1CCC Bits -----------------------------------------------------


;----- I3C1I2CCON Bits -----------------------------------------------------
SDAHT0           EQU  H'0000'
SDAHT1           EQU  H'0001'
FLTEN            EQU  H'0002'


;----- I3C1CLK Bits -----------------------------------------------------
CLK0             EQU  H'0000'
CLK1             EQU  H'0001'
CLK2             EQU  H'0002'
CLK3             EQU  H'0003'


;----- T1CON Bits -----------------------------------------------------
ON_T1CON         EQU  H'0000'
RD16             EQU  H'0001'
NOT_SYNC         EQU  H'0002'
CKPS0_T1CON      EQU  H'0004'
CKPS1_T1CON      EQU  H'0005'
TMR1ON           EQU  H'0000'
T1RD16           EQU  H'0001'
NOT_T1SYNC       EQU  H'0002'
T1CKPS0          EQU  H'0004'
T1CKPS1          EQU  H'0005'
NSYNC            EQU  H'0002'
CKPS0_T1CON      EQU  H'0004'
CKPS1_T1CON      EQU  H'0005'
RD161            EQU  H'0001'
NT1SYNC          EQU  H'0002'


;----- CCPR1 Bits -----------------------------------------------------


