GreatCowBASIC/DATFileGenerator/incfiles/p18F16Q20.inc
;----- OSCEN Bits -----------------------------------------------------
PLLEN            EQU  H'0000'
ADOEN            EQU  H'0002'
SOSCEN           EQU  H'0003'
LFOEN            EQU  H'0004'
MFOEN            EQU  H'0005'
HFOEN            EQU  H'0006'
EXTOEN           EQU  H'0007'


;----- OSCTUNE Bits -----------------------------------------------------
TUN0             EQU  H'0000'
TUN1             EQU  H'0001'
TUN2             EQU  H'0002'
TUN3             EQU  H'0003'
TUN4             EQU  H'0004'
TUN5             EQU  H'0005'
TUN0             EQU  H'0000'
TUN1             EQU  H'0001'
TUN2             EQU  H'0002'
TUN3             EQU  H'0003'
TUN4             EQU  H'0004'
TUN5             EQU  H'0005'


;----- OSCFRQ Bits -----------------------------------------------------
FRQ0             EQU  H'0000'
FRQ1             EQU  H'0001'
FRQ2             EQU  H'0002'
FRQ3             EQU  H'0003'
FRQ0             EQU  H'0000'
FRQ1             EQU  H'0001'
FRQ2             EQU  H'0002'
FRQ3             EQU  H'0003'


;----- ACTCON Bits -----------------------------------------------------
ORS              EQU  H'0001'
LOCK             EQU  H'0003'
UD               EQU  H'0006'
EN               EQU  H'0007'
ACTORS           EQU  H'0001'
ACTLOCK          EQU  H'0003'
ACTUD            EQU  H'0006'
ACTEN            EQU  H'0007'


;----- FSCMCON Bits -----------------------------------------------------
FSCMFEV          EQU  H'0000'
FSCMFFI          EQU  H'0001'
FSCMPEV          EQU  H'0002'
FSCMPFI          EQU  H'0003'
FSCMSEV          EQU  H'0004'
FSCMSFI          EQU  H'0005'


;----- I3C2CON0 Bits -----------------------------------------------------
IBIREQ           EQU  H'0000'
HJREQ            EQU  H'0001'
ACKP             EQU  H'0002'
CLRRXB           EQU  H'0003'
CLRTXB           EQU  H'0004'
RST              EQU  H'0005'
BTOEN            EQU  H'0006'
EN               EQU  H'0007'


;----- I3C2CON1 Bits -----------------------------------------------------
ACKPOS           EQU  H'0000'
SASDRMD          EQU  H'0001'
FHDRE            EQU  H'0002'


;----- I3C2RXB Bits -----------------------------------------------------


;----- I3C2TXB Bits -----------------------------------------------------


;----- I3C2STAT0 Bits -----------------------------------------------------
RNW0             EQU  H'0000'
RNW1             EQU  H'0001'
RXBF             EQU  H'0002'
TXBE             EQU  H'0003'
RSTDET           EQU  H'0004'
OPMD0            EQU  H'0005'
OPMD1            EQU  H'0006'
BFREE            EQU  H'0007'


;----- I3C2STAT1 Bits -----------------------------------------------------
TXFNE            EQU  H'0000'


;----- I3C2BSTAT Bits -----------------------------------------------------
TE0ERR           EQU  H'0000'
TE1ERR           EQU  H'0001'
TE2ERR           EQU  H'0002'
TE3ERR           EQU  H'0003'
TE4ERR           EQU  H'0004'
TE5ERR           EQU  H'0005'
TE6ERR           EQU  H'0006'


;----- I3C2PIR0 Bits -----------------------------------------------------
SCCCIF           EQU  H'0000'
BTFIF            EQU  H'0001'
DADRIF           EQU  H'0002'
SADRIF           EQU  H'0003'
I2CACKIF         EQU  H'0004'
RSCIF            EQU  H'0005'
PCIF             EQU  H'0006'
SCIF             EQU  H'0007'


;----- I3C2ERRIR0 Bits -----------------------------------------------------
UCCCIF           EQU  H'0000'
BTOIF            EQU  H'0001'
BUSEIF           EQU  H'0002'
IBIEIF           EQU  H'0003'
HJEIF            EQU  H'0004'
RXOIF            EQU  H'0005'
TXUIF            EQU  H'0006'
I2CNACKIF        EQU  H'0007'


;----- I3C2ERRIR1 Bits -----------------------------------------------------
RXREIF           EQU  H'0000'
TXWEIF           EQU  H'0001'
MWLOEIF          EQU  H'0002'
ABEIF            EQU  H'0003'


;----- I3C2PIE0 Bits -----------------------------------------------------
SCCCIE           EQU  H'0000'
BTFIE            EQU  H'0001'
DADRIE           EQU  H'0002'
SADRIE           EQU  H'0003'
I2CACKIE         EQU  H'0004'
RSCIE            EQU  H'0005'
PCIE             EQU  H'0006'
SCIE             EQU  H'0007'


;----- I3C2ERRIE0 Bits -----------------------------------------------------
UCCCIE           EQU  H'0000'
BTOIE            EQU  H'0001'
BUSEIE           EQU  H'0002'
IBIEIE           EQU  H'0003'
HJEIE            EQU  H'0004'
RXOIE            EQU  H'0005'
TXUIE            EQU  H'0006'
I2CNACKIE        EQU  H'0007'


;----- I3C2ERRIE1 Bits -----------------------------------------------------
RXREIE           EQU  H'0000'
TXWEIE           EQU  H'0001'
MWLOEIE          EQU  H'0002'
ABEIE            EQU  H'0003'


;----- I3C2BIDL Bits -----------------------------------------------------


;----- I3C2BIDLH Bits -----------------------------------------------------


;----- I3C2BAVL Bits -----------------------------------------------------


;----- I3C2BTO Bits -----------------------------------------------------


;----- I3C2BTOH Bits -----------------------------------------------------


;----- I3C2IBIMDB Bits -----------------------------------------------------
IBIMDB_4_00      EQU  H'0000'
IBIMDB_4_01      EQU  H'0001'
IBIMDB_4_02      EQU  H'0002'
IBIMDB_4_03      EQU  H'0003'
IBIMDB_4_04      EQU  H'0004'
IBIMDB_7_50      EQU  H'0005'
IBIMDB_7_51      EQU  H'0006'
IBIMDB_7_52      EQU  H'0007'


;----- I3C2RETRY Bits -----------------------------------------------------


;----- I3C2FEAT Bits -----------------------------------------------------
HJCAP            EQU  H'0000'
HDRCAP           EQU  H'0001'


;----- I3C2SADR Bits -----------------------------------------------------
SADR0            EQU  H'0000'
SADR1            EQU  H'0001'
SADR2            EQU  H'0002'
SADR3            EQU  H'0003'
SADR4            EQU  H'0004'
SADR5            EQU  H'0005'
SADR6            EQU  H'0006'


;----- I3C2DADR Bits -----------------------------------------------------
DADR0            EQU  H'0000'
DADR1            EQU  H'0001'
DADR2            EQU  H'0002'
DADR3            EQU  H'0003'
DADR4            EQU  H'0004'
DADR5            EQU  H'0005'
DADR6            EQU  H'0006'


;----- I3C2EC Bits -----------------------------------------------------
IBIEN            EQU  H'0000'
CREN             EQU  H'0001'
EC2              EQU  H'0002'
HJEN             EQU  H'0003'
EC_7_40          EQU  H'0004'
EC_7_41          EQU  H'0005'
EC_7_42          EQU  H'0006'
EC_7_43          EQU  H'0007'


;----- I3C2MWL Bits -----------------------------------------------------


;----- I3C2MWLH Bits -----------------------------------------------------


;----- I3C2MRL Bits -----------------------------------------------------


