GreatCowBASIC/DATFileGenerator/incfiles/p18F16Q20.inc
;----- IPR0 Bits -----------------------------------------------------
SWIP             EQU  H'0000'
INT0IP           EQU  H'0001'
INT1IP           EQU  H'0002'
INT2IP           EQU  H'0003'
DMA1SCNTIP       EQU  H'0004'
DMA1DCNTIP       EQU  H'0005'
DMA1ORIP         EQU  H'0006'
DMA1AIP          EQU  H'0007'


;----- IPR2 Bits -----------------------------------------------------
DMA4SCNTIP       EQU  H'0000'
DMA4DCNTIP       EQU  H'0001'
DMA4ORIP         EQU  H'0002'
DMA4AIP          EQU  H'0003'
NVMIP            EQU  H'0004'
CRCIP            EQU  H'0005'
SCANIP           EQU  H'0006'
ACTIP            EQU  H'0007'


;----- IPR3 Bits -----------------------------------------------------
CSWIP            EQU  H'0000'
OSFIP            EQU  H'0001'
VDDIO2IP         EQU  H'0002'
VDDIO3IP         EQU  H'0003'
IOCIP            EQU  H'0004'
TMR0IP           EQU  H'0005'
TMR1IP           EQU  H'0006'
TMR1GIP          EQU  H'0007'


;----- IPR4 Bits -----------------------------------------------------
TMR2IP           EQU  H'0000'
TMR4IP           EQU  H'0001'
TU16AIP          EQU  H'0002'
TU16BIP          EQU  H'0003'
CCP1IP           EQU  H'0004'
CCP2IP           EQU  H'0005'
PWM1PIP          EQU  H'0006'
PWM1IP           EQU  H'0007'


;----- IPR5 Bits -----------------------------------------------------
PWM2PIP          EQU  H'0000'
PWM2IP           EQU  H'0001'
CWG1IP           EQU  H'0002'
CLC1IP           EQU  H'0003'
CLC2IP           EQU  H'0004'
CLC3IP           EQU  H'0005'
CLC4IP           EQU  H'0006'
IOCSRIP          EQU  H'0007'


;----- IPR6 Bits -----------------------------------------------------
U1RXIP           EQU  H'0000'
U1TXIP           EQU  H'0001'
U1IP             EQU  H'0002'
U1EIP            EQU  H'0003'
U2RXIP           EQU  H'0004'
U2TXIP           EQU  H'0005'
U2IP             EQU  H'0006'
U2EIP            EQU  H'0007'


;----- IPR7 Bits -----------------------------------------------------
SPI1RXIP         EQU  H'0000'
SPI1TXIP         EQU  H'0001'
SPI1IP           EQU  H'0002'
I2C1RXIP         EQU  H'0003'
I2C1TXIP         EQU  H'0004'
I2C1IP           EQU  H'0005'
I2C1EIP          EQU  H'0006'


;----- IPR8 Bits -----------------------------------------------------
I3C1RXIP         EQU  H'0000'
I3C1TXIP         EQU  H'0001'
I3C1IP           EQU  H'0002'
I3C1EIP          EQU  H'0003'
I3C1RIP          EQU  H'0004'


;----- IPR9 Bits -----------------------------------------------------
I3C2RXIP         EQU  H'0000'
I3C2TXIP         EQU  H'0001'
I3C2IP           EQU  H'0002'
I3C2EIP          EQU  H'0003'
I3C2RIP          EQU  H'0004'
HLVDIP           EQU  H'0005'
ADIP             EQU  H'0006'
ADTIP            EQU  H'0007'


;----- PORTA Bits -----------------------------------------------------
RA0              EQU  H'0000'
RA1              EQU  H'0001'
RA2              EQU  H'0002'
RA3              EQU  H'0003'
RA4              EQU  H'0004'
RA5              EQU  H'0005'


;----- PORTB Bits -----------------------------------------------------
RB5              EQU  H'0005'
RB6              EQU  H'0006'
RB7              EQU  H'0007'


;----- PORTC Bits -----------------------------------------------------
RC0              EQU  H'0000'
RC1              EQU  H'0001'
RC3              EQU  H'0003'
RC4              EQU  H'0004'
RC5              EQU  H'0005'
RC6              EQU  H'0006'
RC7              EQU  H'0007'


;----- TRISA Bits -----------------------------------------------------
TRISA0           EQU  H'0000'
TRISA1           EQU  H'0001'
TRISA2           EQU  H'0002'
TRISA4           EQU  H'0004'
TRISA5           EQU  H'0005'


;----- TRISB Bits -----------------------------------------------------
TRISB5           EQU  H'0005'
TRISB6           EQU  H'0006'
TRISB7           EQU  H'0007'


;----- TRISC Bits -----------------------------------------------------
TRISC0           EQU  H'0000'
TRISC1           EQU  H'0001'
TRISC3           EQU  H'0003'
TRISC4           EQU  H'0004'
TRISC5           EQU  H'0005'
TRISC6           EQU  H'0006'
TRISC7           EQU  H'0007'


;----- LATA Bits -----------------------------------------------------
LATA0            EQU  H'0000'
LATA1            EQU  H'0001'
LATA2            EQU  H'0002'
LATA4            EQU  H'0004'
LATA5            EQU  H'0005'


;----- LATB Bits -----------------------------------------------------
LATB5            EQU  H'0005'
LATB6            EQU  H'0006'
LATB7            EQU  H'0007'


;----- LATC Bits -----------------------------------------------------
LATC0            EQU  H'0000'
LATC1            EQU  H'0001'
LATC3            EQU  H'0003'
LATC4            EQU  H'0004'
LATC5            EQU  H'0005'
LATC6            EQU  H'0006'
LATC7            EQU  H'0007'


;----- PORTW Bits -----------------------------------------------------
RW0              EQU  H'0000'
RW1              EQU  H'0001'
RW2              EQU  H'0002'
RW3              EQU  H'0003'
RW4              EQU  H'0004'
RW5              EQU  H'0005'
RW6              EQU  H'0006'
RW7              EQU  H'0007'


;----- LATW Bits -----------------------------------------------------
LATW0            EQU  H'0000'
LATW1            EQU  H'0001'
LATW2            EQU  H'0002'
LATW3            EQU  H'0003'
LATW4            EQU  H'0004'
LATW5            EQU  H'0005'
LATW6            EQU  H'0006'
LATW7            EQU  H'0007'


;----- PORTWIN0 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'


;----- PORTWIN2 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'


;----- PORTWIN3 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'


