GreatCowBASIC/DATFileGenerator/incfiles/p18F16Q20.inc
;----- CONFIG4 Options --------------------------------------------------
_BORV_VBOR_1P9_4     EQU  H'FF'; Brown-out Reset Voltage (VBOR) set to 1.9V
_BORV_VBOR_2P45_4    EQU  H'FE'; Brown-out Reset Voltage (VBOR) set to 2.45V
_BORV_VBOR_2P7_4     EQU  H'FD'; Brown-out Reset Voltage (VBOR) set to 2.7V
_BORV_VBOR_2P85_4    EQU  H'FC'; Brown-out Reset Voltage (VBOR) set to 2.8V
_PPS1WAY_ON_4        EQU  H'FF'; PPSLOCKED bit can be cleared and set only once; PPS registers remain locked after one clear/set cycle
_PPS1WAY_OFF_4       EQU  H'F7'; PPSLOCKED bit can be set and cleared repeatedly (subject to the unlock sequence)
_STVREN_ON_4         EQU  H'FF'; Stack full/underflow will cause Reset
_STVREN_OFF_4        EQU  H'EF'; Stack full/underflow will not cause Reset
_LVP_ON_4            EQU  H'FF'; Low voltage programming enabled. MCLR/VPP pin function is MCLR. MCLRE configuration bit is ignored
_LVP_OFF_4           EQU  H'DF'; HV on MCLR/VPP must be used for programming
_DEBUG_OFF_4         EQU  H'FF'; Backround debugger disabled
_DEBUG_ON_4          EQU  H'BF'; Background debugger enabled
_XINST_OFF_4         EQU  H'FF'; Extended Instruction Set and Indexed Addressing Mode disabled
_XINST_ON_4          EQU  H'7F'; Extended Instruction Set and Indexed Addressing Mode enabled

;----- CONFIG5 Options --------------------------------------------------
_WDTCPS_WDTCPS_0_5   EQU  H'E0'; Divider ratio 1:32
_WDTCPS_WDTCPS_1_5   EQU  H'E1'; Divider ratio 1:64
_WDTCPS_WDTCPS_2_5   EQU  H'E2'; Divider ratio 1:128
_WDTCPS_WDTCPS_3_5   EQU  H'E3'; Divider ratio 1:256
_WDTCPS_WDTCPS_4_5   EQU  H'E4'; Divider ratio 1:512
_WDTCPS_WDTCPS_5_5   EQU  H'E5'; Divider ratio 1:1024
_WDTCPS_WDTCPS_6_5   EQU  H'E6'; Divider ratio 1:2048
_WDTCPS_WDTCPS_7_5   EQU  H'E7'; Divider ratio 1:4096
_WDTCPS_WDTCPS_8_5   EQU  H'E8'; Divider ratio 1:8192
_WDTCPS_WDTCPS_9_5   EQU  H'E9'; Divider ratio 1:16384
_WDTCPS_WDTCPS_10_5  EQU  H'EA'; Divider ratio 1:32768
_WDTCPS_WDTCPS_11_5  EQU  H'EB'; Divider ratio 1:65536
_WDTCPS_WDTCPS_12_5  EQU  H'EC'; Divider ratio 1:131072
_WDTCPS_WDTCPS_13_5  EQU  H'ED'; Divider ratio 1:262144
_WDTCPS_WDTCPS_14_5  EQU  H'EE'; Divider ratio 1:524299
_WDTCPS_WDTCPS_15_5  EQU  H'EF'; Divider ratio 1:1048576
_WDTCPS_WDTCPS_16_5  EQU  H'F0'; Divider ratio 1:2097152
_WDTCPS_WDTCPS_17_5  EQU  H'F1'; Divider ratio 1:4194304
_WDTCPS_WDTCPS_18_5  EQU  H'F2'; Divider ratio 1:8388608
_WDTCPS_WDTCPS_19_5  EQU  H'F3'; Divider ratio 1:32
_WDTCPS_WDTCPS_20_5  EQU  H'F4'; Divider ratio 1:32
_WDTCPS_WDTCPS_21_5  EQU  H'F5'; Divider ratio 1:32
_WDTCPS_WDTCPS_22_5  EQU  H'F6'; Divider ratio 1:32
_WDTCPS_WDTCPS_23_5  EQU  H'F7'; Divider ratio 1:32
_WDTCPS_WDTCPS_24_5  EQU  H'F8'; Divider ratio 1:32
_WDTCPS_WDTCPS_25_5  EQU  H'F9'; Divider ratio 1:32
_WDTCPS_WDTCPS_26_5  EQU  H'FA'; Divider ratio 1:32
_WDTCPS_WDTCPS_27_5  EQU  H'FB'; Divider ratio 1:32
_WDTCPS_WDTCPS_28_5  EQU  H'FC'; Divider ratio 1:32
_WDTCPS_WDTCPS_29_5  EQU  H'FD'; Divider ratio 1:32
_WDTCPS_WDTCPS_30_5  EQU  H'FE'; Divider ratio 1:32
_WDTCPS_WDTCPS_31_5  EQU  H'FF'; Divider ratio 1:65536; software control of WDTPS
_WDTE_OFF_5          EQU  H'9F'; WDT Disabled; SEN is ignored
_WDTE_SEN_5          EQU  H'BF'; WDT enabled/disabled by SEN bit
_WDTE_NSLEEP_5       EQU  H'DF'; WDT enabled while sleep=0, suspended when sleep=1; SEN ignored
_WDTE_ON_5           EQU  H'FF'; WDT enabled regardless of sleep; SEN is ignored

;----- CONFIG6 Options --------------------------------------------------
_WDTCWS_WDTCWS_0_6   EQU  H'F8'; window delay = 87.5; no software control; keyed access required
_WDTCWS_WDTCWS_1_6   EQU  H'F9'; window delay = 75 percent of time; no software control; keyed access required
_WDTCWS_WDTCWS_2_6   EQU  H'FA'; window delay = 62.5 percent of time; no software control; keyed access required
_WDTCWS_WDTCWS_3_6   EQU  H'FB'; window delay = 50 percent of time; no software control; keyed access required
_WDTCWS_WDTCWS_4_6   EQU  H'FC'; window delay = 37.5 percent of time; no software control; keyed access required
_WDTCWS_WDTCWS_5_6   EQU  H'FD'; window delay = 25 percent of time; no software control; keyed access required
_WDTCWS_WDTCWS_6_6   EQU  H'FE'; window always open (100%); no software control; keyed access required
_WDTCWS_WDTCWS_7_6   EQU  H'FF'; window always open (100%); software control; keyed access not required
_WDTCCS_LFINTOSC_6   EQU  H'C7'; WDT reference clock is the 31.0 kHz LFINTOSC (when WDTE != 0b00)
_WDTCCS_MFINTOSC_6   EQU  H'CF'; WDT reference clock is the 31.25kHz MFINTOSC output (when WDTE != 0b00)
_WDTCCS_SOSC_6       EQU  H'D7'; WDT reference clock is SOSC (when WDTE != 0b00)
_WDTCCS_SC_6         EQU  H'FF'; Software Control (when WDTE != 0b00)

;----- CONFIG7 Options --------------------------------------------------
_VDDIO2MD_STANDARD_RANGE_7 EQU  H'FF'; Standard Operating Range (VDDIO2 >= 1.62V)
_VDDIO2MD_LOW_VOLTAGE_RANGE_7 EQU  H'FE'; Low-voltage Operating Range (VDDIO2 < 1.62V)
_VDDIO3MD_STANDARD_RANGE_7 EQU  H'FF'; Standard Operating Range (VDDIO3 >= 1.62V)
_VDDIO3MD_LOW_VOLTAGE_RANGE_7 EQU  H'FD'; Low-voltage Operating Range (VDDIO3 < 1.62V)

;----- CONFIG8 Options --------------------------------------------------
_BBSIZE_BBSIZE_16384_8 EQU  H'7F'; Boot Block size is 16384 words
_BBSIZE_BBSIZE_16256_8 EQU  H'7E'; Boot Block size is 16256 words
_BBSIZE_BBSIZE_16128_8 EQU  H'7D'; Boot Block size is 16128 words
_BBSIZE_BBSIZE_16000_8 EQU  H'7C'; Boot Block size is 16000 words
_BBSIZE_BBSIZE_15872_8 EQU  H'7B'; Boot Block size is 15872 words
_BBSIZE_BBSIZE_15744_8 EQU  H'7A'; Boot Block size is 15744 words
_BBSIZE_BBSIZE_15616_8 EQU  H'79'; Boot Block size is 15616 words
_BBSIZE_BBSIZE_15488_8 EQU  H'78'; Boot Block size is 15488 words
_BBSIZE_BBSIZE_15360_8 EQU  H'77'; Boot Block size is 15360 words
_BBSIZE_BBSIZE_15232_8 EQU  H'76'; Boot Block size is 15232 words
_BBSIZE_BBSIZE_15104_8 EQU  H'75'; Boot Block size is 15104 words
_BBSIZE_BBSIZE_14976_8 EQU  H'74'; Boot Block size is 14976 words
_BBSIZE_BBSIZE_14848_8 EQU  H'73'; Boot Block size is 14848 words
_BBSIZE_BBSIZE_14720_8 EQU  H'72'; Boot Block size is 14720 words
_BBSIZE_BBSIZE_14592_8 EQU  H'71'; Boot Block size is 14592 words
_BBSIZE_BBSIZE_14464_8 EQU  H'70'; Boot Block size is 14464 words
_BBSIZE_BBSIZE_14336_8 EQU  H'6F'; Boot Block size is 14336 words
_BBSIZE_BBSIZE_14208_8 EQU  H'6E'; Boot Block size is 14208 words
_BBSIZE_BBSIZE_14080_8 EQU  H'6D'; Boot Block size is 14080 words
_BBSIZE_BBSIZE_13952_8 EQU  H'6C'; Boot Block size is 13952 words
_BBSIZE_BBSIZE_13824_8 EQU  H'6B'; Boot Block size is 13824 words
_BBSIZE_BBSIZE_13696_8 EQU  H'6A'; Boot Block size is 13696 words
_BBSIZE_BBSIZE_13568_8 EQU  H'69'; Boot Block size is 13568 words
_BBSIZE_BBSIZE_13440_8 EQU  H'68'; Boot Block size is 13440 words
_BBSIZE_BBSIZE_13312_8 EQU  H'67'; Boot Block size is 13312 words
_BBSIZE_BBSIZE_13184_8 EQU  H'66'; Boot Block size is 13184 words
_BBSIZE_BBSIZE_13056_8 EQU  H'65'; Boot Block size is 13056 words
_BBSIZE_BBSIZE_12928_8 EQU  H'64'; Boot Block size is 12928 words
_BBSIZE_BBSIZE_12800_8 EQU  H'63'; Boot Block size is 12800 words
_BBSIZE_BBSIZE_12672_8 EQU  H'62'; Boot Block size is 12672 words
_BBSIZE_BBSIZE_12544_8 EQU  H'61'; Boot Block size is 12544 words
_BBSIZE_BBSIZE_12416_8 EQU  H'60'; Boot Block size is 12416 words
_BBSIZE_BBSIZE_12288_8 EQU  H'5F'; Boot Block size is 12288 words
_BBSIZE_BBSIZE_12160_8 EQU  H'5E'; Boot Block size is 12160 words
_BBSIZE_BBSIZE_12032_8 EQU  H'5D'; Boot Block size is 12032 words
_BBSIZE_BBSIZE_11904_8 EQU  H'5C'; Boot Block size is 11904 words
_BBSIZE_BBSIZE_11776_8 EQU  H'5B'; Boot Block size is 11776 words
_BBSIZE_BBSIZE_11648_8 EQU  H'5A'; Boot Block size is 11648 words
_BBSIZE_BBSIZE_11520_8 EQU  H'59'; Boot Block size is 11520 words
_BBSIZE_BBSIZE_11392_8 EQU  H'58'; Boot Block size is 11392 words
_BBSIZE_BBSIZE_11264_8 EQU  H'57'; Boot Block size is 11264 words
_BBSIZE_BBSIZE_11136_8 EQU  H'56'; Boot Block size is 11136 words
_BBSIZE_BBSIZE_11008_8 EQU  H'55'; Boot Block size is 11008 words
_BBSIZE_BBSIZE_10880_8 EQU  H'54'; Boot Block size is 10880 words
_BBSIZE_BBSIZE_10752_8 EQU  H'53'; Boot Block size is 10752 words
_BBSIZE_BBSIZE_10624_8 EQU  H'52'; Boot Block size is 10624 words
_BBSIZE_BBSIZE_10496_8 EQU  H'51'; Boot Block size is 10496 words
_BBSIZE_BBSIZE_10368_8 EQU  H'50'; Boot Block size is 10368 words
_BBSIZE_BBSIZE_10240_8 EQU  H'4F'; Boot Block size is 10240 words
_BBSIZE_BBSIZE_10112_8 EQU  H'4E'; Boot Block size is 10112 words
_BBSIZE_BBSIZE_9984_8 EQU  H'4D'; Boot Block size is 9984 words
_BBSIZE_BBSIZE_9856_8 EQU  H'4C'; Boot Block size is 9856 words
_BBSIZE_BBSIZE_9728_8 EQU  H'4B'; Boot Block size is 9728 words
_BBSIZE_BBSIZE_9600_8 EQU  H'4A'; Boot Block size is 9600 words
_BBSIZE_BBSIZE_9472_8 EQU  H'49'; Boot Block size is 9472 words
_BBSIZE_BBSIZE_9344_8 EQU  H'48'; Boot Block size is 9344 words
_BBSIZE_BBSIZE_9216_8 EQU  H'47'; Boot Block size is 9216 words
_BBSIZE_BBSIZE_9088_8 EQU  H'46'; Boot Block size is 9088 words
_BBSIZE_BBSIZE_8960_8 EQU  H'45'; Boot Block size is 8960 words
_BBSIZE_BBSIZE_8832_8 EQU  H'44'; Boot Block size is 8832 words
_BBSIZE_BBSIZE_8704_8 EQU  H'43'; Boot Block size is 8704 words
_BBSIZE_BBSIZE_8576_8 EQU  H'42'; Boot Block size is 8576 words
_BBSIZE_BBSIZE_8448_8 EQU  H'41'; Boot Block size is 8448 words
_BBSIZE_BBSIZE_8320_8 EQU  H'40'; Boot Block size is 8320 words
_BBSIZE_BBSIZE_8192_8 EQU  H'3F'; Boot Block size is 8192 words
_BBSIZE_BBSIZE_8064_8 EQU  H'3E'; Boot Block size is 8064 words
_BBSIZE_BBSIZE_7936_8 EQU  H'3D'; Boot Block size is 7936 words
_BBSIZE_BBSIZE_7808_8 EQU  H'3C'; Boot Block size is 7808 words
_BBSIZE_BBSIZE_7680_8 EQU  H'3B'; Boot Block size is 7680 words
_BBSIZE_BBSIZE_7552_8 EQU  H'3A'; Boot Block size is 7552 words
_BBSIZE_BBSIZE_7424_8 EQU  H'39'; Boot Block size is 7424 words
_BBSIZE_BBSIZE_7296_8 EQU  H'38'; Boot Block size is 7296 words
_BBSIZE_BBSIZE_7168_8 EQU  H'37'; Boot Block size is 7168 words
_BBSIZE_BBSIZE_7040_8 EQU  H'36'; Boot Block size is 7040 words
_BBSIZE_BBSIZE_6912_8 EQU  H'35'; Boot Block size is 6912 words
_BBSIZE_BBSIZE_6784_8 EQU  H'34'; Boot Block size is 6784 words
_BBSIZE_BBSIZE_6656_8 EQU  H'33'; Boot Block size is 6656 words
_BBSIZE_BBSIZE_6528_8 EQU  H'32'; Boot Block size is 6528 words
_BBSIZE_BBSIZE_6400_8 EQU  H'31'; Boot Block size is 6400 words
_BBSIZE_BBSIZE_6272_8 EQU  H'30'; Boot Block size is 6272 words
_BBSIZE_BBSIZE_6144_8 EQU  H'2F'; Boot Block size is 6144 words
_BBSIZE_BBSIZE_6016_8 EQU  H'2E'; Boot Block size is 6016 words
_BBSIZE_BBSIZE_5888_8 EQU  H'2D'; Boot Block size is 5888 words
_BBSIZE_BBSIZE_5760_8 EQU  H'2C'; Boot Block size is 5760 words
_BBSIZE_BBSIZE_5632_8 EQU  H'2B'; Boot Block size is 5632 words
_BBSIZE_BBSIZE_5504_8 EQU  H'2A'; Boot Block size is 5504 words
_BBSIZE_BBSIZE_5376_8 EQU  H'29'; Boot Block size is 5376 words
_BBSIZE_BBSIZE_5248_8 EQU  H'28'; Boot Block size is 5248 words
_BBSIZE_BBSIZE_5120_8 EQU  H'27'; Boot Block size is 5120 words
_BBSIZE_BBSIZE_4992_8 EQU  H'26'; Boot Block size is 4992 words
_BBSIZE_BBSIZE_4864_8 EQU  H'25'; Boot Block size is 4864 words
_BBSIZE_BBSIZE_4736_8 EQU  H'24'; Boot Block size is 4736 words
_BBSIZE_BBSIZE_4608_8 EQU  H'23'; Boot Block size is 4608 words
_BBSIZE_BBSIZE_4480_8 EQU  H'22'; Boot Block size is 4480 words
_BBSIZE_BBSIZE_4352_8 EQU  H'21'; Boot Block size is 4352 words
_BBSIZE_BBSIZE_4224_8 EQU  H'20'; Boot Block size is 4224 words
_BBSIZE_BBSIZE_4096_8 EQU  H'1F'; Boot Block size is 4096 words
_BBSIZE_BBSIZE_3968_8 EQU  H'1E'; Boot Block size is 3968 words
_BBSIZE_BBSIZE_3840_8 EQU  H'1D'; Boot Block size is 3840 words
_BBSIZE_BBSIZE_3712_8 EQU  H'1C'; Boot Block size is 3712 words
_BBSIZE_BBSIZE_3584_8 EQU  H'1B'; Boot Block size is 3584 words
_BBSIZE_BBSIZE_3456_8 EQU  H'1A'; Boot Block size is 3456 words
_BBSIZE_BBSIZE_3328_8 EQU  H'19'; Boot Block size is 3328 words
_BBSIZE_BBSIZE_3200_8 EQU  H'18'; Boot Block size is 3200 words
_BBSIZE_BBSIZE_3072_8 EQU  H'17'; Boot Block size is 3072 words
_BBSIZE_BBSIZE_2944_8 EQU  H'16'; Boot Block size is 2944 words
_BBSIZE_BBSIZE_2816_8 EQU  H'15'; Boot Block size is 2816 words
_BBSIZE_BBSIZE_2688_8 EQU  H'14'; Boot Block size is 2688 words
_BBSIZE_BBSIZE_2560_8 EQU  H'13'; Boot Block size is 2560 words
_BBSIZE_BBSIZE_2432_8 EQU  H'12'; Boot Block size is 2432 words
_BBSIZE_BBSIZE_2304_8 EQU  H'11'; Boot Block size is 2304 words
_BBSIZE_BBSIZE_2176_8 EQU  H'10'; Boot Block size is 2176 words
_BBSIZE_BBSIZE_2048_8 EQU  H'F0'; Boot Block size is 2048 words
_BBSIZE_BBSIZE_1920_8 EQU  H'E0'; Boot Block size is 1920 words
_BBSIZE_BBSIZE_1792_8 EQU  H'D0'; Boot Block size is 1792 words
_BBSIZE_BBSIZE_1664_8 EQU  H'C0'; Boot Block size is 1664 words
_BBSIZE_BBSIZE_1536_8 EQU  H'B0'; Boot Block size is 1536 words
_BBSIZE_BBSIZE_1408_8 EQU  H'A0'; Boot Block size is 1408 words
_BBSIZE_BBSIZE_1280_8 EQU  H'90'; Boot Block size is 1280 words
_BBSIZE_BBSIZE_1152_8 EQU  H'80'; Boot Block size is 1152 words
_BBSIZE_BBSIZE_1024_8 EQU  H'70'; Boot Block size is 1024 words
_BBSIZE_BBSIZE_896_8 EQU  H'60'; Boot Block size is 896 words
_BBSIZE_BBSIZE_768_8 EQU  H'50'; Boot Block size is 768 words
_BBSIZE_BBSIZE_640_8 EQU  H'40'; Boot Block size is 640 words
_BBSIZE_BBSIZE_512_8 EQU  H'30'; Boot Block size is 512 words
_BBSIZE_BBSIZE_384_8 EQU  H'20'; Boot Block size is 384 words
_BBSIZE_BBSIZE_256_8 EQU  H'10'; Boot Block size is 256 words
_BBSIZE_BBSIZE_128_8 EQU  H'00'; Boot Block size is 128 words

